[
    {
        "name" : "KalebStanzak.github.io",
        "description":"This is the website you're currently on! Originally a simple html page i made for class, I later modified the html to be just my resume. After a bit of work inbetween classes, this website is now what youre currently viewing. This site is built in Angular 18, and hosted on a github page. Documentation and the websites code can be found",
        "apiLink" : "https://api.github.com/repos/KalebStanzak/KalebStanzak.github.io/commits",
        "projectLink" : "https://github.com/KalebStanzak/KalebStanzak.github.io"
    },
    {
        "name" : "U-Fund Project: Humane Society Funding",
        "description":"A semester long project built for SWEN 261 alongside a group. The repository linked is a copy of a privated repository. My role within this project was as a coder, where i primarily worked on Java code meant to handle users, their permissions, and interactions. The project consisted of a back end spring tomcat server, with a Angular frontend. It utilized a REST api to retrieve and modify data for display. The projects documentation and code can be found",
        "apiLink" : "https://api.github.com/repos/KalebStanzak/public-swen261-project-dangerouslydydx/commits",
        "projectLink" : "https://github.com/KalebStanzak/public-swen261-project-dangerouslydydx"
    },
    {
        "name":"C-Practicums and Project",
        "description":"These are SWEN 250 tests and a project written in vim where i was given base functions and a description of what they should do, then had to code the described function under a time limit. The public copy of this code is found",
        "apiLink":"https://api.github.com/repos/KalebStanzak/CPracticumAndProj/commits",
        "projectLink":"https://github.com/KalebStanzak/CPracticumAndProj"
    },
    {
        "name" : "Various C",
        "description":"A collection of C code written in vim for SWEN 250, primarily expiriments and tests from when I was learning the basics of how C works. The unsorted collection of code, which is in a public copied repository can be found",
        "apiLink" : "https://api.github.com/repos/KalebStanzak/VariousCPublic/commits",
        "projectLink" : "https://github.com/KalebStanzak/VariousCPublic"
    },
    {
        "name":"Swen250 CppPubllic",
        "description":"Some Cpp files from the end of SWEN 250 written in vim, placed in a public repository. Contains a mix of learning material and projects. The repository containing the code is",
        "apiLink":"https://api.github.com/repos/KalebStanzak/SWEN250CppPublic/commits",
        "projectLink":"https://github.com/KalebStanzak/SWEN250CppPublic"
    }
]
